PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/Infineon_retarget-io-latest/cy_retarget_io.c
            if (rslt != CY_RSLT_SUCCESS)
            {
                break;
            }

#ifdef CY_RETARGET_IO_CONVERT_LF_TO_CRLF
            cy_retarget_io_stdout_prev_char = *buffer;
#endif // CY_RETARGET_IO_CONVERT_LF_TO_CRLF
            ++buffer;
        }
    }
    return (nChars);
}


#else // (__GNUC__)  GCC
#if !defined(CY_RETARGET_IO_NO_FLOAT)
// Add an explicit reference to the floating point printf library to allow the usage of floating
// point conversion specifier.
__asm(".global _printf_float");
#endif
//--------------------------------------------------------------------------------------------------
// _write
//--------------------------------------------------------------------------------------------------
__attribute__((weak)) int32_t _write(int32_t fd, const cy_char8_t* ptr, int32_t len)
{
    int32_t nChars = 0;
    (void)fd;
    if (ptr != NULL)
    {
        cy_rslt_t rslt = CY_RSLT_SUCCESS;
        cy_retarget_io_mutex_acquire();
        for (; nChars < len; ++nChars)
        {
#ifdef CY_RETARGET_IO_CONVERT_LF_TO_CRLF
            if ((*ptr == '\n') && (cy_retarget_io_stdout_prev_char != '\r'))
            {
                rslt = cy_retarget_io_putchar('\r');
            }
#endif // CY_RETARGET_IO_CONVERT_LF_TO_CRLF

            if (CY_RSLT_SUCCESS == rslt)
            {
                rslt = cy_retarget_io_putchar((uint32_t) * ptr);
            }

            if (CY_RSLT_SUCCESS != rslt)
            {
                break;
            }

#ifdef CY_RETARGET_IO_CONVERT_LF_TO_CRLF
            cy_retarget_io_stdout_prev_char = *ptr;
#endif // CY_RETARGET_IO_CONVERT_LF_TO_CRLF
            ++ptr;
        }
        cy_retarget_io_mutex_release();
    }
    return (nChars);
}


#endif // if defined(__ARMCC_VERSION)


#if defined(__ARMCC_VERSION) // ARM-MDK
#if defined (COMPONENT_MTB_HAL)
//--------------------------------------------------------------------------------------------------
// $Sub$$fgetc
//--------------------------------------------------------------------------------------------------
int $Sub$$fgetc(FILE* f)
#else
//--------------------------------------------------------------------------------------------------
// fgetc
//--------------------------------------------------------------------------------------------------
__attribute__((weak)) int fgetc(FILE* f)
#endif /* defined(COMPONENT_MTB_HAL) */
{
    (void)f;
    char c;
    cy_rslt_t rslt = cy_retarget_io_getchar(&c);
    return (CY_RSLT_SUCCESS == rslt) ? c : EOF;
}


#if defined (COMPONENT_MTB_HAL)
//--------------------------------------------------------------------------------------------------
// $Sub$$_fgetc$unlocked
//--------------------------------------------------------------------------------------------------
int $Sub$$_fgetc$unlocked(FILE* f)
#else
//--------------------------------------------------------------------------------------------------
// _fgetc$unlocked
//--------------------------------------------------------------------------------------------------
__attribute__((weak)) int _fgetc$unlocked(FILE* f)
#endif /* defined(COMPONENT_MTB_HAL) */
{
    (void)f;
    char c;
    cy_rslt_t rslt = cy_retarget_io_getchar(&c);
    return (CY_RSLT_SUCCESS == rslt) ? c : EOF;
}


#elif defined (__ICCARM__) // IAR
//--------------------------------------------------------------------------------------------------
// __read
//--------------------------------------------------------------------------------------------------
__weak size_t __read(int handle, unsigned char* buffer, size_t size)
{
    // This template only reads from "standard in", for all other file handles it returns failure.
    if ((handle != _LLIO_STDIN) || (buffer == NULL))
    {
        return (_LLIO_ERROR);
    }
    else
    {
        cy_rslt_t rslt = cy_retarget_io_getchar((char*)buffer);
        return (CY_RSLT_SUCCESS == rslt) ? 1 : 0;
    }
}


#elif defined(__llvm__)
// Nothing to do, putc/getc all defined in the first #if/#else section.

#else // (__GNUC__)  GCC
#if !defined(CY_RETARGET_IO_NO_FLOAT)
// Add an explicit reference to the floating point scanf library to allow the usage of floating
// point conversion specifier.
__asm(".global _scanf_float");
#endif
//--------------------------------------------------------------------------------------------------
// _read
//--------------------------------------------------------------------------------------------------
__attribute__((weak)) int32_t _read(int32_t fd, cy_char8_t* ptr, int32_t len)
{
    (void)fd;

    int32_t nChars = 0;
    if (ptr != NULL)
    {
        cy_rslt_t rslt;
        do
        {
            rslt = cy_retarget_io_getchar(ptr);
            if (rslt == CY_RSLT_SUCCESS)
            {
                ++nChars;
                if ((*ptr == '\n') || (*ptr == '\r'))
                {
                    break;
                }
                ptr++;
            }
        }
        while ((rslt == CY_RSLT_SUCCESS) && (nChars < len));
    }

    return (nChars);
}


#endif // if defined(__ARMCC_VERSION)

#if defined(__ARMCC_VERSION) // ARM-MDK
// Include _sys_* prototypes provided by ARM Compiler runtime library
#include <rt_sys.h>

// Prevent linkage of library functions that use semihosting calls
__asm(".global __use_no_semihosting\n\t");

// Enable the linker to select an optimized library that does not include code to handle input
// arguments to main()
__asm(".global __ARM_use_no_argv\n\t");

//--------------------------------------------------------------------------------------------------
// _sys_open
//
// Open a file: dummy implementation.
// Everything goes to the same output, no need to translate the file names
// (__stdin_name/__stdout_name/__stderr_name) to descriptor numbers
//--------------------------------------------------------------------------------------------------
FILEHANDLE __attribute__((weak)) _sys_open(const char* name, int openmode)
{
    (void)name;
    (void)openmode;
    return 1;
}


//--------------------------------------------------------------------------------------------------
// _sys_close
//
// Close a file: dummy implementation.
//--------------------------------------------------------------------------------------------------
int __attribute__((weak)) _sys_close(FILEHANDLE fh)
{
    (void)fh;
    return 0;
}


//--------------------------------------------------------------------------------------------------
// _sys_write
//
// Write to a file: dummy implementation.
// The low-level function fputc retargets output to use UART TX
//--------------------------------------------------------------------------------------------------
int __attribute__((weak)) _sys_write(FILEHANDLE fh, const unsigned char* buf, unsigned len,
                                     int mode)
{
    (void)fh;
    (void)buf;
    (void)len;
    (void)mode;
    return 0;
}


//--------------------------------------------------------------------------------------------------
// _sys_read
//
// Read from a file: dummy implementation.
// The low-level function fputc retargets input to use UART RX
//--------------------------------------------------------------------------------------------------
int __attribute__((weak)) _sys_read(FILEHANDLE fh, unsigned char* buf, unsigned len, int mode)
{
    (void)fh;
    (void)buf;
    (void)len;
    (void)mode;
    return -1;
}


//--------------------------------------------------------------------------------------------------
// _ttywrch
//
// Write a character to the output channel: dummy implementation.
//--------------------------------------------------------------------------------------------------
void __attribute__((weak)) _ttywrch(int ch)
{
    (void)ch;
}


//--------------------------------------------------------------------------------------------------
// _sys_istty
//
// Check if the file is connected to a terminal: dummy implementation
//--------------------------------------------------------------------------------------------------
int __attribute__((weak)) _sys_istty(FILEHANDLE fh)
{
    (void)fh;
    return 0;
}


//--------------------------------------------------------------------------------------------------
// _sys_seek
//
// Move the file position to a given offset: dummy implementation
//--------------------------------------------------------------------------------------------------
int __attribute__((weak)) _sys_seek(FILEHANDLE fh, long pos)
{
    (void)fh;
    (void)pos;
    return -1;
}


//--------------------------------------------------------------------------------------------------
// _sys_flen
// Return the current length of a file: dummy implementation
//--------------------------------------------------------------------------------------------------
long __attribute__((weak)) _sys_flen(FILEHANDLE fh)
{
    (void)fh;
    return 0;
}


//--------------------------------------------------------------------------------------------------
// _sys_exit
//
// Terminate the program: dummy implementation
//--------------------------------------------------------------------------------------------------
void __attribute__((weak)) _sys_exit(int returncode)
{
    (void)returncode;
    for (;;)
    {
        // Halt here forever
    }
}


//--------------------------------------------------------------------------------------------------
// _sys_command_string
//
// Return a pointer to the command line: dummy implementation
//--------------------------------------------------------------------------------------------------
char __attribute__((weak)) *_sys_command_string(char* cmd, int len)
{
    (void)cmd;
    (void)len;
    return NULL;
}


#endif // ARM-MDK

