PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/Infineon_retarget-io-latest/cy_retarget_io.c
#if defined (COMPONENT_MTB_HAL)
//--------------------------------------------------------------------------------------------------
// cy_retarget_io_init
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_retarget_io_init(mtb_hal_uart_t* obj)
{
    CY_ASSERT(NULL != obj);
    cy_retarget_io_uart_obj = obj;
    return cy_retarget_io_mutex_init();
}


#elif defined(CY_USING_HAL)
//--------------------------------------------------------------------------------------------------
// cy_retarget_io_init_fc
//
// Enables user to provide flow control pins during initialization
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_retarget_io_init_fc(cyhal_gpio_t tx, cyhal_gpio_t rx, cyhal_gpio_t cts,
                                 cyhal_gpio_t rts, uint32_t baudrate)
{
    const cyhal_uart_cfg_t uart_config =
    {
        .data_bits          = 8,
        .stop_bits          = 1,
        .parity             = CYHAL_UART_PARITY_NONE,
        .rx_buffer          = NULL,
        .rx_buffer_size     = 0
    };

#if (CYHAL_API_VERSION >= 2)
    cy_rslt_t result = cyhal_uart_init(&cy_retarget_io_uart_obj, tx, rx, cts, rts, NULL,
                                       &uart_config);
#else // HAL API before version 2
    cy_rslt_t result = cyhal_uart_init(&cy_retarget_io_uart_obj, tx, rx, NULL, &uart_config);
    if (result == CY_RSLT_SUCCESS)
    {
        result = cyhal_uart_set_flow_control(&cy_retarget_io_uart_obj, cts, rts);
    }
#endif

    if (result == CY_RSLT_SUCCESS)
    {
        result = cyhal_uart_set_baud(&cy_retarget_io_uart_obj, baudrate, NULL);
    }

    if (result == CY_RSLT_SUCCESS)
    {
        result = cy_retarget_io_mutex_init();
    }

    return result;
}


//--------------------------------------------------------------------------------------------------
// cy_retarget_io_init_hal
//
// Initailize retarget-io mutex for thead-safe during initialization
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_retarget_io_init_hal(void)
{
    return cy_retarget_io_mutex_init();
}


#else // if defined(COMPONENT_MTB_HAL)

//--------------------------------------------------------------------------------------------------
// cy_retarget_io_init
//
// Initializes the UART for retarget-io.  UART must already be initialized and enabled.
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_retarget_io_init(CySCB_Type* uart)
{
    if (uart == NULL)
    {
        return CY_RETARGET_IO_RSLT_NULL_UART_PTR;
    }
    else
    {
        cy_retarget_io_uart = uart;
        return cy_retarget_io_mutex_init();
    }
}


#endif // defined(COMPONENT_MTB_HAL)


//--------------------------------------------------------------------------------------------------
// cy_retarget_io_is_tx_active
//--------------------------------------------------------------------------------------------------
bool cy_retarget_io_is_tx_active(void)
{
#if defined(COMPONENT_MTB_HAL)
    CY_ASSERT(NULL != cy_retarget_io_uart_obj);
    return mtb_hal_uart_is_tx_active(cy_retarget_io_uart_obj);
#elif defined (CY_USING_HAL)
    return cyhal_uart_is_tx_active(&cy_retarget_io_uart_obj);
#else
    return !Cy_SCB_IsTxComplete(cy_retarget_io_uart);
#endif
}


//--------------------------------------------------------------------------------------------------
// cy_retarget_io_deinit
//--------------------------------------------------------------------------------------------------
void cy_retarget_io_deinit(void)
{
    // Since the largest hardware buffer would be 256 bytes
    // it takes about 500 ms to transmit the 256 bytes at 9600 baud.
    // Thus 1000 ms gives roughly 50% padding to this time.
    int32_t timeout_remaining_ms = 1000;
    while (timeout_remaining_ms > 0)
    {
        if (!cy_retarget_io_is_tx_active())
        {
            break;
        }
#if defined(COMPONENT_MTB_HAL)
        mtb_hal_system_delay_ms(1);
#elif defined(CY_USING_HAL)
        cyhal_system_delay_ms(1);
#else
        Cy_SysLib_Delay(1);
#endif //defined(COMPONENT_MTB_HAL)
        timeout_remaining_ms--;
    }
    CY_ASSERT(timeout_remaining_ms != 0);
#if defined(COMPONENT_MTB_HAL)
    cy_retarget_io_uart_obj = NULL;
#elif defined(CY_USING_HAL)
    cyhal_uart_free(&cy_retarget_io_uart_obj);
#else
    cy_retarget_io_uart = NULL;
#endif //defined(COMPONENT_MTB_HAL)
    cy_retarget_io_mutex_deinit();
}


#if defined(__cplusplus)
}
#endif
